LCS_Testcases/LCS_Testcase_doubleGyre/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     doubleGyre;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         24;

deltaT          0.01;

writeControl    runTime;

writeInterval   1.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
{
    lagrangianCoherentStructures
    {
        type            LCS;
        // Where to load it from (if not already in solver)
        functionObjectLibs ("libLCSFunctionObject.so");

        // Specifies if the main mesh is a static rectlinear Mesh 
        // (if yes the main cfd mesh is also used for the lcs computations)
        // (if not a rectlinear LCS blockMesh has to be created under constant/LCS/polyMesh beforehand)  
        isStaticRectLinear true;

        // Numer of cells in mesh in x, y and z direction (must correspond with used mesh)
        n (256 128 1);

        // Velocity field name
        velocityName "U";

        // Start time of LCS diagnostic - (default: startTime of simulation)
        lcsStartTime 0;

        // End time of LCS diagnostic - (default: endTime of simulation)
        lcsEndTime 24;

        // LCS output interval in s
        lcsWriteTimeIntervall 1.5;

        // Switches for FTLE field evaluation 
        // - Forward time (repelling) FTLE field - (default: true/on)
        ftleFwd    on;
        // - Backward time (attracting) FTLE field - (default: false/off)
        ftleBkwd   on;

        // Specifies addition or removal of grid points for the diagnostic calculation
        // - 0 LCS diagnostic will be computed on same grid (is default)
        // - 1, 2, ... Diagnostic will be computed on a grid with resolution times more grid points
        // - -1, -2, ... Diagnostic will be computed on a grid with resolution times less grid points
        resolution 0;

        lcsCFL          0.9;

        integrator      rk3;

        interpolator    linear;
        

        // LCS Options
        lcsOptions
        {
            synctimer       off;
            debug           off;
            writeFlowmap    on;
            writeBCFlags    on;
            incompressible  on;
            auxGrid         off;
        }
    }
}


// ************************************************************************* //
